app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "answers" ("answerer", "body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answerer", "hello"], ["body", "goodbye"], ["question_id", 13], ["created_at", "2016-06-14 16:28:27.133093"], ["updated_at", "2016-06-14 16:28:27.133093"]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 13]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question

    if @answer.save
      flash[:success] = "Answer Saved Successfully"
      redirect_to question_path(@question)
    else
      flash[:errors] = @answer.errors.full_messages.join(', ')

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "answers" SET "best" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["best", "t"], ["updated_at", "2016-06-15 18:19:46.354082"], ["id", 11]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 19]]
---
  def update
    @answer = Answer.find(params[:id])
    @question = @answer.question

    Answer.update_all(best: false)

    if @answer.update(best: true)
      flash[:success] = "Answer successfully updated"
      redirect_to question_path(@question)
    else
      flash[:errors] = @answer.errors.full_messages.join(', ')