app/controllers/questions_controller.rb

  def index
    @questions = Question.order(created_at: :desc)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order(best: :desc)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best" DESC  [["question_id", 19]]

  def create
    @question = Question.new(question_params)

    if @question.save
      flash[:success] = "Question successfully added."
      redirect_to questions_path(@questions)
    else
      flash[:errors] = @question.errors.full_messages.join(', ')
---
INSERT INTO "questions" ("asker", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["asker", "Frank"], ["title", "How do I forms?"], ["body", "blah blah blah"], ["created_at", "2016-06-14 15:54:29.300233"], ["updated_at", "2016-06-14 15:54:29.300233"]]
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "UPDATEEEEE"], ["updated_at", "2016-06-14 16:54:24.881280"], ["id", 13]]